The complete explanation for this notebook is at https://youranalystbuddy.com/pandas-dataframe/
    
## Pandas dataframe

In [1]:
import pandas as pd

students = pd.read_csv('students.csv')
students

     StudentID FirstName      LastName  HighSchoolGPA  FirstYearGPA
0    202005537    Eunice        Ehmann           2.47          2.42
1    202008560    Hobert  Schoenberger           2.27          2.05
2    202004948  Nicholas         Sizer           4.00          3.96
3    202001207     Elvin        Foulks           3.16          2.64
4    202000260     Bruno         Viney           3.82          3.99
..         ...       ...           ...            ...           ...
195  202000691     Judge   Grandinetti           3.44          3.35
196  202009695   Winston        Kaneko           2.94          2.41
197  202008725  Thaddeus          Chen           3.59          3.50
198  202001120    Wright     Marburger           2.41          2.11
199  202009418    Sidney   Sienkiewicz           3.19          3.30

[200 rows x 5 columns]

### Basic functions

In [2]:
students.head(n=3)

   StudentID FirstName      LastName  HighSchoolGPA  FirstYearGPA
0  202005537    Eunice        Ehmann           2.47          2.42
1  202008560    Hobert  Schoenberger           2.27          2.05
2  202004948  Nicholas         Sizer           4.00          3.96

In [3]:
students.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   StudentID      200 non-null    int64
 1   FirstName      200 non-null    object
 2   LastName       200 non-null    object
 3   HighSchoolGPA  200 non-null    float64
 4   FirstYearGPA   200 non-null    float64
dtypes: float64(2), int64(1), object(2)
memory usage: 7.9+ KB

In [4]:
students.shape

(200, 5)

### Slicing dataframes

In [5]:
students['HighSchoolGPA']

0      2.47
1      2.27
2      4.00
3      3.16
4      3.82
       ...
195    3.44
196    2.94
197    3.59
198    2.41
199    3.19
Name: HighSchoolGPA, Length: 200, dtype: float64

In [6]:
students[['FirstName','LastName','FirstYearGPA']]

    FirstName      LastName  FirstYearGPA
0      Eunice        Ehmann          2.42
1      Hobert  Schoenberger          2.05
2    Nicholas         Sizer          3.96
3       Elvin        Foulks          2.64
4       Bruno         Viney          3.99
..        ...           ...           ...
195     Judge   Grandinetti          3.35
196   Winston        Kaneko          2.41
197  Thaddeus          Chen          3.50
198    Wright     Marburger          2.11
199    Sidney   Sienkiewicz          3.30

[200 rows x 3 columns]

In [7]:
students.loc[[10,60,110],['FirstName','LastName','FirstYearGPA']]

    FirstName     LastName  FirstYearGPA
10       Olin      Mcclain          2.09
60   Benjamin  Brinkerhoff          2.44
110    Bessie      Bushman          2.90

In [8]:
students.loc[students['FirstName']=='Elvin',:]

     StudentID FirstName  LastName  HighSchoolGPA  FirstYearGPA
3    202001207     Elvin    Foulks           3.16          2.64
97   202002022     Elvin     Monje           2.95          2.08
133  202007347     Elvin  Stansell           2.82          2.37